MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_adc.h
  * @brief   Header file of ADC HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_ADC_H
#define STM32C5XX_HAL_ADC_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_adc.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined(ADC1) || defined(ADC2) || defined(ADC3)

/** @defgroup ADC ADC
  * @{
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @addtogroup ADC_Private_Constants
  *  @{
  */
#define HAL_ADC_CALIB_FACTORS_BUF_SIZE  1U   /*!< ADC calibration factors buffer size */

#define HAL_ADC_GROUPS_COUNT            2U   /*!< HAL ADC handle internal tables size to manage ADC groups
                                                  (on this STM32 series, ADC groups available : regular, injected) */

#define HAL_ADC_OPT_DMA_SHIFT           16U  /*!< Optional interruptions literals HAL_ADC_OPT_DMA_x bitfield shift
                                                  for compliance with literals HAL_ADC_OPT_IT_x. */
/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_Exported_Constants HAL ADC Exported Constants
  * @{
  */

#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
/** @defgroup  ADC_error_codes Error codes defined has bitfields
  * @{
  */
#define HAL_ADC_ERROR_NONE              (0UL)                 /*!< No error */
#define HAL_ADC_ERROR_INTERNAL          (1UL << 0U)           /*!< ADC peripheral hardware error (issue of clocking,
                                                                   erroneous state, lock up, ...) */
/* ADC group regular specific errors */
#define HAL_ADC_REG_ERROR_OVR           (1UL << 1U)           /*!< ADC group regular overrun error */
#define HAL_ADC_REG_ERROR_DMA           (1UL << 2U)           /*!< ADC group regular DMA transfer error */
/**
  * @}
  */
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */

/** @defgroup ADC_optional_interruptions Optional interruptions
  * @note     To be used as parameters of functions HAL_ADC_..._StartConv_IT_Opt(),
  *           HAL_ADC_..._StartConv_DMA_Opt()
  * @{
  */
#define HAL_ADC_OPT_IT_NONE             (0U)                    /*!< ADC optional interruptions disabled  */
#define HAL_ADC_OPT_IT_REG_EOSMP        (LL_ADC_IT_EOSMP)       /*!< ADC optional interruption group regular end of
                                        sampling phase */
#define HAL_ADC_OPT_IT_REG_EOC          (LL_ADC_IT_EOC)         /*!< ADC optional interruption group regular end of
                                        unitary conversion */
#define HAL_ADC_OPT_IT_REG_EOS          (LL_ADC_IT_EOS)         /*!< ADC optional interruption group regular end of
                                        sequence conversions */
#define HAL_ADC_OPT_IT_REG_OVR          (LL_ADC_IT_OVR)         /*!< ADC optional interruption group regular
                                        overrun */
#define HAL_ADC_OPT_IT_INJ_EOC          (LL_ADC_IT_JEOC)        /*!< ADC optional interruption group injected end of
                                        unitary conversion */
#define HAL_ADC_OPT_IT_INJ_EOS          (LL_ADC_IT_JEOS)        /*!< ADC optional interruption group injected end of
                                        sequence conversions */
#define HAL_ADC_OPT_IT_AWD_1            (LL_ADC_IT_AWD1)        /*!< ADC optional interruption analog watchdog 1
                                        out of window event */
#define HAL_ADC_OPT_IT_AWD_2            (LL_ADC_IT_AWD2)        /*!< ADC optional interruption analog watchdog 2
                                        out of window event */
#define HAL_ADC_OPT_IT_AWD_3            (LL_ADC_IT_AWD3)        /*!< ADC optional interruption analog watchdog 3
                                        out of window event */

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
#define HAL_ADC_OPT_DMA_IT_NONE         (HAL_DMA_OPT_IT_NONE)   /*!< ADC data transfer with DMA optional interruptions
                                        disabled.
                                        DMA default interruptions: transfer complete, transfer error.
                                        DMA optional interruptions: refer to literals below. */
#define HAL_ADC_OPT_DMA_IT_HT           (HAL_DMA_OPT_IT_HT << HAL_ADC_OPT_DMA_SHIFT) /*!< ADC data transfer with
                                        DMA optional interruption buffer half transfer */
#define HAL_ADC_OPT_DMA_IT_DEFAULT      (HAL_DMA_OPT_IT_DEFAULT << HAL_ADC_OPT_DMA_SHIFT) /*!< ADC data transfer with
                                        DMA optional interruptions all enabled */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define HAL_ADC_OPT_DMA_IT_SILENT       (HAL_DMA_OPT_IT_SILENT) /*!< ADC data transfer with all interruptions
                                        disabled (ADC and DMA interruptions) */
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_ADC_DMA */
/**
  * @}
  */

/** @defgroup ADC_helper_macro  Definitions of constants used by helper macro
  * @{
  */
#define HAL_ADC_TEMPERATURE_CALC_ERROR  LL_ADC_TEMPERATURE_CALC_ERROR /*!< Temperature calculation error using helper
                                        macro @ref HAL_ADC_CALC_TEMPERATURE(), due to issue on calibration parameters.
                                        This value is coded on 16 bits (to fit on signed word or double word) and
                                        corresponds to an inconsistent temperature value. */
/**
  * @}
  */


/**
  * @}
  */

