MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.h
/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_Exported_Macro ADC Exported Macro
  * @{
  */

/**
  * @brief  Helper macro to calculate the voltage (unit: mVolt)
  *         corresponding to a ADC conversion data (unit: digital value).
  * @param  vref_analog_voltage Analog reference voltage Vref+ (unit: mVolt)
  * @param  conv_data  ADC conversion data (unit: digital value)
  * @param  resolution ADC resolution at which ADC conversion has been performed.
  *                    Value among @ref hal_adc_resolution_t
  * @note   Analog reference voltage (Vref+) must be either known from
  *         user board environment or can be calculated using ADC measurement
  *         and ADC helper macro @ref HAL_ADC_CALC_VREFANALOG_VOLTAGE().
  * @note   Arguments data type converted to signed (int32_t) to handle all possible input values
  *         (conversion data can be negative after post-processing computation: offset feature)
  * @retval ADC conversion data equivalent voltage value (unit: mVolt)
  */
#define HAL_ADC_CALC_DATA_TO_VOLTAGE(vref_analog_voltage, \
                                     conv_data, \
                                     resolution) \
LL_ADC_CALC_DATA_TO_VOLTAGE((vref_analog_voltage), \
                            (conv_data), \
                            (uint32_t)(resolution))

/**
  * @brief  Helper macro to calculate the ADC conversion data (unit: digital value)
  *         corresponding to a voltage (unit: mVolt).
  * @param  vref_analog_voltage Analog reference voltage Vref+ (unit: mVolt)
  * @param  voltage_mv ADC conversion data voltage value (unit: mVolt)
  * @param  resolution ADC resolution at which ADC conversion has been performed.
  *                    Value among @ref hal_adc_resolution_t
  * @note   Analog reference voltage (Vref+) must be either known from
  *         user board environment or can be calculated using ADC measurement
  *         and ADC helper macro @ref HAL_ADC_CALC_VREFANALOG_VOLTAGE().
  * @note   Arguments data type converted to signed (int32_t) to handle all possible input values
  *         (conversion data can be negative after post-processing computation: offset feature)
  * @retval ADC conversion data equivalent value (unit: digital value)
  */
#define HAL_ADC_CALC_VOLTAGE_TO_DATA(vref_analog_voltage, \
                                     voltage_mv, \
                                     resolution) \
LL_ADC_CALC_VOLTAGE_TO_DATA((vref_analog_voltage), \
                            (voltage_mv), \
                            (uint32_t)(resolution))

/**
  * @brief  Helper macro to calculate analog reference voltage (Vref+)
  *         (unit: mVolt) from ADC conversion data of internal voltage
  *         reference VrefInt.
  * @param  vrefint_conv_data ADC conversion data
  *         of internal voltage reference VrefInt (unit: digital value).
  * @param  resolution ADC resolution at which ADC conversion has been performed.
  *                    Value among hal_adc_resolution_t
  * @note   Computation is using VrefInt calibration value
  *         stored in system memory for each device during production.
  * @note   This voltage depends on user board environment: voltage level
  *         connected to pin Vref+.
  *         On devices with small package, the pin Vref+ is not present
  *         and internally bonded to pin Vdda.
  * @retval Analog reference voltage (unit: mVolt)
  */
#define HAL_ADC_CALC_VREFANALOG_VOLTAGE(vrefint_conv_data, \
                                        resolution) \
LL_ADC_CALC_VREFANALOG_VOLTAGE((vrefint_conv_data), \
                               (uint32_t)(resolution))

/**
  * @brief  Helper macro to calculate the temperature (unit: degree Celsius)
  *         from ADC conversion data of internal temperature sensor.
  * @param  vref_analog_voltage  Analog reference voltage Vref+ (unit: mVolt)
  * @param  tempsensor_conv_data ADC conversion data of internal
  *                              temperature sensor (unit: digital value).
  * @param  resolution ADC resolution at which ADC conversion has been performed.
  *                    Value among hal_adc_resolution_t
  * @note   Computation is using temperature sensor calibration values
  *         stored in system memory for each device during production.
  *         To calculate temperature using temperature sensor
  *                  datasheet typical values (generic values less, therefore
  *                  less accurate than calibrated values),
  *                  use helper macro LL_ADC_CALC_TEMPERATURE_TYP_PARAMS().
  * @note   Analog reference voltage (Vref+) must be either known from
  *         user board environment or can be calculated using ADC measurement
  *         and ADC helper macro @ref HAL_ADC_CALC_VREFANALOG_VOLTAGE().
  * @retval Temperature (unit: degree Celsius) or error code (value HAL_ADC_TEMPERATURE_CALC_ERROR)
  */
#define HAL_ADC_CALC_TEMPERATURE(vref_analog_voltage, \
                                 tempsensor_conv_data, \
                                 resolution) \
LL_ADC_CALC_TEMPERATURE((vref_analog_voltage), \
                        (tempsensor_conv_data), \
                        (uint32_t)(resolution))

/**
  * @brief  Helper macro to get ADC channel number in decimal format
  *         from literals HAL_ADC_CHANNEL_x.
  * @param  channel Value among hal_adc_channel_t, limited to channels HAL_ADC_CHANNEL_x.
  * @note   Example:
  *           HAL_ADC_CHANNEL_TO_DECIMAL_NB(HAL_ADC_CHANNEL_4)
  *           will return decimal number "4".
  * @note   Compliant channels are channels connected to GPIO (not internal channels).
  *         For more details, refer to LL_ADC_CHANNEL_TO_DECIMAL_NB().
  * @retval Value between Min_Data=0 and Max_Data=23
  */
#define HAL_ADC_CHANNEL_TO_DECIMAL_NB(channel) \
  LL_ADC_CHANNEL_TO_DECIMAL_NB((uint32_t)(channel))

/**
  * @brief  Helper macro to get ADC channel in literal format HAL_ADC_CHANNEL_x
  *         from number in decimal format.
  * @param  decimal_nb Value between Min_Data=0 and Max_Data=23
  * @note   Example:
  *           HAL_ADC_DECIMAL_NB_TO_CHANNEL(4)
  *           will return a data equivalent to "HAL_ADC_CHANNEL_4".
  * @note   Compliant channels are channels connected to GPIO (not internal channels).
  *         For more details, refer to LL_ADC_DECIMAL_NB_TO_CHANNEL().
  * @retval Value among hal_adc_channel_t, limited to channels HAL_ADC_CHANNEL_x.
  */
#define HAL_ADC_DECIMAL_NB_TO_CHANNEL(decimal_nb) \
  LL_ADC_DECIMAL_NB_TO_CHANNEL((uint32_t)(decimal_nb))

/**
  * @brief  Helper macro to define the ADC conversion data full-scale digital
  *         maximum value corresponding to the selected ADC resolution.
  * @param  resolution Value among hal_adc_resolution_t
  * @note   ADC conversion data full-scale corresponds to voltage range
  *         determined by analog voltage references Vref+ and Vref- (refer to reference manual).
  * @note   Value returned corresponds to range maximum value without post-processing computation.
  *         With post-processing (offset, gain), conversion data maximum value can exceed this range
  *         (as well as minimum value in negative range).
  * @retval ADC conversion data full-scale digital value
  */
#define HAL_ADC_DIGITAL_SCALE(resolution) \
  LL_ADC_DIGITAL_SCALE((uint32_t)(resolution))

/**
  * @brief  Helper macro to convert the ADC conversion data from
  *         a resolution to another resolution.
  * @param  data ADC conversion data to be converted
  * @param  adc_res_current Value among hal_adc_resolution_t
  * @param  adc_res_target Value among hal_adc_resolution_t
  * @retval ADC conversion data to the requested resolution
  */
#define HAL_ADC_CONVERT_DATA_RESOLUTION(data, \
                                        adc_res_current, \
                                        adc_res_target) \
LL_ADC_CONVERT_DATA_RESOLUTION((data), \
                               (uint32_t)(adc_res_current), \
                               (uint32_t)(adc_res_target))

/**
  * @}
  */

