MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.h
/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup  ADC_Exported_Types ADC Exported Types
  * @{
  */

/**
  * @brief HAL ADC instance
  */
typedef enum
{
  HAL_ADC1 = ADC1_BASE,
#if defined(ADC2)
  HAL_ADC2 = ADC2_BASE,
#endif /* ADC2 */
#if defined(ADC3)
  HAL_ADC3 = ADC3_BASE,
#endif /* ADC3 */
} hal_adc_t;

/**
  * @brief ADC global state
  */
typedef enum
{
  HAL_ADC_STATE_RESET                   = 0U,              /*!< ADC not yet initialized */
  HAL_ADC_STATE_INIT                    = (1U << 31U),     /*!< ADC initialized but not yet configured */
  HAL_ADC_STATE_CONFIGURING             = (1U << 30U),     /*!< ADC configuration ongoing (step optional
                                        depending on series or ADC instances) */
  HAL_ADC_STATE_IDLE                    = (1U << 29U),     /*!< ADC configured and ready to be activated */
  HAL_ADC_STATE_ACTIVE                  = (1U << 28U),     /*!< ADC activated, ready to operate
                                        (ADC conversions depending on ADC groups state) */
  HAL_ADC_STATE_CALIB                   = (1U << 27U),     /*!< ADC calibration ongoing */
} hal_adc_state_t;

/**
  * @brief ADC group (regular, injected) state
  */
typedef enum
{
  HAL_ADC_GROUP_STATE_RESET             = (1U << 31U), /*!< ADC group not yet initialized */
  HAL_ADC_GROUP_STATE_IDLE              = (1U << 30U), /*!< ADC group initialized and ready to operate */
  HAL_ADC_GROUP_STATE_ACTIVE            = (1U << 29U), /*!< ADC group operating (ADC conversion ongoing
                                        or can start upon trigger request) */
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  HAL_ADC_GROUP_STATE_ACTIVE_SILENT     = (1U << 28U), /*!< ADC group operating (ADC conversion ongoing
                                        or can start upon trigger request) without any
                                        interruption */
#endif /* USE_HAL_ADC_DMA */
} hal_adc_group_state_t;

/**
  * @brief HAL ADC handle link to common instance state
  */
typedef enum
{
  HAL_ADC_COMMON_STATE_RESET            = 0,           /*!< HAL ADC handle link to common instance not yet initialized*/
  HAL_ADC_COMMON_STATE_INDEPT           = (1U << 31U), /*!< HAL ADC handle independent (not linked to common instance)*/
  HAL_ADC_COMMON_STATE_LINKED           = (1U << 30U), /*!< HAL ADC handle linked to other handles of common instance */
  HAL_ADC_COMMON_STATE_MM               = (1U << 29U), /*!< HAL ADC handle linked to other handles of common instance
                                        and configured in multimode */
} hal_adc_common_state_t;

/**
  * @brief HAL ADC group conversions per conversion start configuration
  */
typedef enum
{
  HAL_ADC_GROUP_CONV_UNIT               = 0U,   /*!< HAL ADC group configured to have a unitary (only one) conversion
                                        per conversion start */
  HAL_ADC_GROUP_CONV_MULTIPLE           = 1U,   /*!< HAL ADC group configured to have multiple conversions
                                        from one conversion start (for example: continuous mode,
                                        trigger from timer, ...) */
} hal_adc_group_conv_per_start_t;

/**
  * @brief HAL ADC resolution
  */
typedef enum
{
  HAL_ADC_RESOLUTION_6_BIT              = LL_ADC_RESOLUTION_6B,   /*!< ADC resolution 6 bit */
  HAL_ADC_RESOLUTION_8_BIT              = LL_ADC_RESOLUTION_8B,   /*!< ADC resolution 8 bit */
  HAL_ADC_RESOLUTION_10_BIT             = LL_ADC_RESOLUTION_10B,  /*!< ADC resolution 10 bit */
  HAL_ADC_RESOLUTION_12_BIT             = LL_ADC_RESOLUTION_12B,  /*!< ADC resolution 12 bit */
} hal_adc_resolution_t;

/**
  * @brief HAL ADC data shift left
  */
typedef enum
{
  HAL_ADC_LEFT_BIT_SHIFT_NONE           = LL_ADC_LEFT_BIT_SHIFT_NONE, /*!< ADC conversion data not shifted
                                        (alignment right, on data register MSB bit 0) */
  HAL_ADC_LEFT_BIT_SHIFT_1_BIT          = LL_ADC_LEFT_BIT_SHIFT_1,    /*!< ADC conversion data shift left of 1 bit
                                        (data multiplied by 2) */
  HAL_ADC_LEFT_BIT_SHIFT_2_BITS         = LL_ADC_LEFT_BIT_SHIFT_2,    /*!< ADC conversion data shift left of 2 bits
                                        (data multiplied by 4) */
  HAL_ADC_LEFT_BIT_SHIFT_3_BITS         = LL_ADC_LEFT_BIT_SHIFT_3,    /*!< ADC conversion data shift left of 3 bits
                                        (data multiplied by 8) */
  HAL_ADC_LEFT_BIT_SHIFT_4_BITS         = LL_ADC_LEFT_BIT_SHIFT_4,    /*!< ADC conversion data shift left of 4 bits
                                        (data multiplied by 16) */
  HAL_ADC_LEFT_BIT_SHIFT_5_BITS         = LL_ADC_LEFT_BIT_SHIFT_5,    /*!< ADC conversion data shift left of 5 bits
                                        (data multiplied by 32) */
  HAL_ADC_LEFT_BIT_SHIFT_6_BITS         = LL_ADC_LEFT_BIT_SHIFT_6,    /*!< ADC conversion data shift left of 6 bits
                                        (data multiplied by 64) */
  HAL_ADC_LEFT_BIT_SHIFT_7_BITS         = LL_ADC_LEFT_BIT_SHIFT_7,    /*!< ADC conversion data shift left of 7 bits
                                        (data multiplied by 128) */
  HAL_ADC_LEFT_BIT_SHIFT_8_BITS         = LL_ADC_LEFT_BIT_SHIFT_8,    /*!< ADC conversion data shift left of 8 bits
                                        (data multiplied by 256) */
  HAL_ADC_LEFT_BIT_SHIFT_9_BITS         = LL_ADC_LEFT_BIT_SHIFT_9,    /*!< ADC conversion data shift left of 9 bits
                                        (data multiplied by 512) */
  HAL_ADC_LEFT_BIT_SHIFT_10_BITS        = LL_ADC_LEFT_BIT_SHIFT_10,    /*!< ADC conversion data shift left of 10 bits
                                        (data multiplied by 1024) */
  HAL_ADC_LEFT_BIT_SHIFT_11_BITS        = LL_ADC_LEFT_BIT_SHIFT_11,    /*!< ADC conversion data shift left of 11 bits
                                        (data multiplied by 2048) */
  HAL_ADC_LEFT_BIT_SHIFT_12_BITS        = LL_ADC_LEFT_BIT_SHIFT_12,    /*!< ADC conversion data shift left of 12 bits
                                        (data multiplied by 4096) */
  HAL_ADC_LEFT_BIT_SHIFT_13_BITS        = LL_ADC_LEFT_BIT_SHIFT_13,    /*!< ADC conversion data shift left of 13 bits
                                        (data multiplied by 8192) */
  HAL_ADC_LEFT_BIT_SHIFT_14_BITS        = LL_ADC_LEFT_BIT_SHIFT_14,    /*!< ADC conversion data shift left of 14 bits
                                        (data multiplied by 16384) */
  HAL_ADC_LEFT_BIT_SHIFT_15_BITS        = LL_ADC_LEFT_BIT_SHIFT_15,    /*!< ADC conversion data shift left of 15 bits
                                        (data multiplied by 32768) */
} hal_adc_left_bit_shift_t;

/**
  * @brief HAL ADC low power feature auto wait
  */
typedef enum
{
  HAL_ADC_LP_AUTO_WAIT_DISABLE          = LL_ADC_LP_MODE_NONE, /*!< ADC low power mode auto delay disabled. */
  HAL_ADC_LP_AUTO_WAIT_ENABLE           = LL_ADC_LP_AUTOWAIT   /*!< ADC low power mode auto delay enabled: dynamic
                                        low power mode, ADC conversions are performed only when necessary
                                        (when previous ADC conversion data is read).
                                        Refer to detailed description of function LL_ADC_SetLPModeAutoWait(). */
} hal_adc_lp_auto_wait_state_t;

/**
  * @brief HAL ADC sampling mode
  */
typedef enum
{
  HAL_ADC_SAMPLING_MODE_NORMAL          = LL_ADC_SAMPLING_MODE_NORMAL, /*!< ADC conversions sampling phase duration
                                        is defined using hal_adc_sampling_time_t. */
  HAL_ADC_SAMPLING_MODE_BULB            = LL_ADC_SAMPLING_MODE_BULB,   /*!< ADC conversions sampling phase starts
                                        immediately after end of conversion, stops upon trigger event.
                                        Note: First conversion is using minimal sampling time
                                              (refer to hal_adc_sampling_time_t).
                                        Note: Usable only if conversions from ADC group regular (not ADC group injected)
                                              and not in continuous mode. */
  HAL_ADC_SAMPLING_MODE_TRIGGER_CTRL    = LL_ADC_SAMPLING_MODE_TRIGGER_CTRL /*!< ADC conversions sampling phase
                                        by trigger events: trigger rising edge starts sampling,
                                        trigger falling edge stops sampling and start conversion.
                                        Note: Usable only if conversions from ADC group regular (not ADC group injected)
                                              and not in continuous mode. */
} hal_adc_sampling_mode_t;

/**
  * @brief HAL ADC groups
  */
typedef enum
{
  HAL_ADC_GROUP_REGULAR                 = LL_ADC_GROUP_REGULAR,          /*!< ADC group regular */
  HAL_ADC_GROUP_INJECTED                = LL_ADC_GROUP_INJECTED,         /*!< ADC group injected */
  HAL_ADC_GROUP_REGULAR_INJECTED        = LL_ADC_GROUP_REGULAR_INJECTED, /*!< ADC both groups regular and injected
                                        (usable only by specific functions: analog watchdog configuration) */
  HAL_ADC_GROUP_NONE                    = LL_ADC_GROUP_NONE,             /*!< ADC group none.
                                        Note: Can be used to remove a channel from analog watchdog monitoring. */
} hal_adc_group_t;

/**
  * @brief HAL ADC group regular conversion trigger source
  */
typedef enum
{
  HAL_ADC_REG_TRIG_SOFTWARE             = LL_ADC_REG_TRIG_SOFTWARE,      /*!< ADC group regular conversion
                                        trigger from software start */
  HAL_ADC_REG_TRIG_EXTI11               = LL_ADC_REG_TRIG_EXTI11,        /*!< ADC group regular conversion
                                        trigger from periph: EXTI line 11 */
  HAL_ADC_REG_TRIG_TIM1_OC1             = LL_ADC_REG_TRIG_TIM1_OC1,      /*!< ADC group regular conversion
                                        trigger from periph: TIM1 channel 1. */
  HAL_ADC_REG_TRIG_TIM1_OC2             = LL_ADC_REG_TRIG_TIM1_OC2,      /*!< ADC group regular conversion
                                        trigger from periph: TIM1 channel 2. */
  HAL_ADC_REG_TRIG_TIM1_OC3             = LL_ADC_REG_TRIG_TIM1_OC3,      /*!< ADC group regular conversion
                                        trigger from periph: TIM1 channel 3. */
  HAL_ADC_REG_TRIG_TIM1_TRGO            = LL_ADC_REG_TRIG_TIM1_TRGO,    /*!< ADC group regular conversion
                                        trigger from periph: TIM1 TRGO */
  HAL_ADC_REG_TRIG_TIM1_TRGO2           = LL_ADC_REG_TRIG_TIM1_TRGO2,    /*!< ADC group regular conversion
                                        trigger from periph: TIM1 TRGO2 */
  HAL_ADC_REG_TRIG_TIM2_OC2             = LL_ADC_REG_TRIG_TIM2_OC2,      /*!< ADC group regular conversion
                                        trigger from periph: TIM2 channel 2. */
  HAL_ADC_REG_TRIG_TIM2_TRGO            = LL_ADC_REG_TRIG_TIM2_TRGO,     /*!< ADC group regular conversion
                                        trigger from periph: TIM2 TRGO */
#if defined(STM32C591xx) || defined(STM32C593xx) || defined(STM32C5A3xx)
  HAL_ADC_REG_TRIG_TIM3_OC4             = LL_ADC_REG_TRIG_TIM3_OC4,      /*!< ADC group regular conversion
                                        trigger from periph: TIM3 channel 4. */
  HAL_ADC_REG_TRIG_TIM3_TRGO            = LL_ADC_REG_TRIG_TIM3_TRGO,     /*!< ADC group regular conversion
                                        trigger from periph: TIM3 TRGO */
  HAL_ADC_REG_TRIG_TIM4_OC4             = LL_ADC_REG_TRIG_TIM4_OC4,      /*!< ADC group regular conversion
                                        trigger from periph: TIM4 channel 4. */
  HAL_ADC_REG_TRIG_TIM4_TRGO            = LL_ADC_REG_TRIG_TIM4_TRGO,     /*!< ADC group regular conversion
                                        trigger from periph: TIM4 TRGO */
#endif /* STM32C591xx, STM32C593xx, STM32C5A3xx */
  HAL_ADC_REG_TRIG_TIM5_OC4             = LL_ADC_REG_TRIG_TIM5_OC4,      /*!< ADC group regular conversion
                                        trigger from periph: TIM5 channel 4. */
  HAL_ADC_REG_TRIG_TIM5_TRGO            = LL_ADC_REG_TRIG_TIM5_TRGO,     /*!< ADC group regular conversion
                                        trigger from periph: TIM5 TRGO */
  HAL_ADC_REG_TRIG_TIM6_TRGO            = LL_ADC_REG_TRIG_TIM6_TRGO,     /*!< ADC group regular conversion
                                        trigger from periph: TIM6 TRGO */
  HAL_ADC_REG_TRIG_TIM8_TRGO            = LL_ADC_REG_TRIG_TIM8_TRGO,     /*!< ADC group regular conversion
                                        trigger from periph: TIM8 TRGO */
  HAL_ADC_REG_TRIG_TIM8_TRGO2           = LL_ADC_REG_TRIG_TIM8_TRGO2,    /*!< ADC group regular conversion
                                        trigger from periph: TIM8 TRGO2 */
  HAL_ADC_REG_TRIG_TIM15_TRGO           = LL_ADC_REG_TRIG_TIM15_TRGO,    /*!< ADC group regular conversion
                                        trigger from periph: TIM15 TRGO */
#if defined(LPTIM1)
  HAL_ADC_REG_TRIG_LPTIM1_OC1           = LL_ADC_REG_TRIG_LPTIM1_OC1,    /*!< ADC group regular conversion
                                        trigger from periph: LPTIM1 channel 1. */
#endif /* LPTIM1 */
} hal_adc_reg_trig_src_t;

/**
  * @brief HAL ADC group regular conversion trigger edge
  */
typedef enum
{
  HAL_ADC_REG_TRIG_EDGE_NONE            = 0x00000000UL,                      /*!< ADC group regular conversion
                                        trigger disabled (SW start) */
  HAL_ADC_REG_TRIG_EDGE_RISING          = LL_ADC_REG_TRIG_RISING,        /*!< ADC group regular conversion
                                        trigger polarity set to rising edge */
  HAL_ADC_REG_TRIG_EDGE_FALLING         = LL_ADC_REG_TRIG_FALLING,       /*!< ADC group regular conversion
                                        trigger polarity set to falling edge */
  HAL_ADC_REG_TRIG_EDGE_RISING_FALLING  = LL_ADC_REG_TRIG_RISING_FALLING, /*!< ADC group regular conversion
                                        trigger polarity set to both rising and falling edges */
} hal_adc_reg_trig_edge_t;

/**
  * @brief HAL ADC group regular sequencer scan discontinuous length
  */
typedef enum
{
  HAL_ADC_REG_SEQ_DISCONT_DISABLE       = LL_ADC_REG_SEQ_DISCONT_DISABLE, /*!< ADC group regular sequencer discontinuous
                                        mode disabled */
  HAL_ADC_REG_SEQ_DISCONT_1RANK         = LL_ADC_REG_SEQ_DISCONT_1RANK,   /*!< ADC group regular sequencer discontinuous
                                        mode enabled with sequence interruption every rank */
  HAL_ADC_REG_SEQ_DISCONT_2RANKS        = LL_ADC_REG_SEQ_DISCONT_2RANKS,  /*!< ADC group regular sequencer discontinuous
                                        mode enabled with sequence interruption every 2 ranks. */
  HAL_ADC_REG_SEQ_DISCONT_3RANKS        = LL_ADC_REG_SEQ_DISCONT_3RANKS,  /*!< ADC group regular sequencer discontinuous
                                        mode enabled with sequence interruption every 3 ranks. */
  HAL_ADC_REG_SEQ_DISCONT_4RANKS        = LL_ADC_REG_SEQ_DISCONT_4RANKS,  /*!< ADC group regular sequencer discontinuous
                                        mode enabled with sequence interruption every 4 ranks. */
  HAL_ADC_REG_SEQ_DISCONT_5RANKS        = LL_ADC_REG_SEQ_DISCONT_5RANKS,  /*!< ADC group regular sequencer discontinuous
                                        mode enabled with sequence interruption every 5 ranks. */
  HAL_ADC_REG_SEQ_DISCONT_6RANKS        = LL_ADC_REG_SEQ_DISCONT_6RANKS,  /*!< ADC group regular sequencer discontinuous
                                        mode enabled with sequence interruption every 6 ranks. */
  HAL_ADC_REG_SEQ_DISCONT_7RANKS        = LL_ADC_REG_SEQ_DISCONT_7RANKS,  /*!< ADC group regular sequencer discontinuous
                                        mode enabled with sequence interruption every 7 ranks. */
  HAL_ADC_REG_SEQ_DISCONT_8RANKS        = LL_ADC_REG_SEQ_DISCONT_8RANKS   /*!< ADC group regular sequencer discontinuous
                                        mode enabled with sequence interruption every 8 ranks. */
} hal_adc_reg_seq_discont_length_t;

/**
  * @brief HAL ADC group regular continuous mode
  */
typedef enum
{
  HAL_ADC_REG_CONV_SINGLE               = LL_ADC_REG_CONV_SINGLE,    /*!< ADC conversions performed in single mode:
                                        conversions start from a trigger, are performed for each channel of
                                        the sequence, then stop. */
  HAL_ADC_REG_CONV_CONTINUOUS           = LL_ADC_REG_CONV_CONTINUOUS /*!< ADC conversions performed in continuous mode:
                                        conversions start from a trigger, are performed for each channel of
                                        the sequence, then restart automatically. */
} hal_adc_reg_continuous_mode_t;

/**
  * @brief HAL ADC group regular overrun mode.
  * @note     Overrun occurs when conversion is completed while conversion data in data register (from previous
  *           conversion) has not been fetched (by CPU or DMA).
  */
typedef enum
{
  HAL_ADC_REG_OVR_DATA_PRESERVED        = LL_ADC_REG_OVR_DATA_PRESERVED,    /*!< ADC group regular behavior in case of
                                        overrun: data preserved.
                                        Note: an internal FIFO of 8 elements is enabled in this mode. Overrun occurs
                                              when the FIFO overflows. FIFO is emptied by successive reads of
                                              data register. */
  HAL_ADC_REG_OVR_DATA_OVERWRITTEN      = LL_ADC_REG_OVR_DATA_OVERWRITTEN /*!< ADC group regular behavior in case of
                                        overrun: data overwritten */
} hal_adc_reg_overrun_mode_t;

/**
  * @brief HAL ADC group injected conversion trigger source
  */
typedef enum
{
  HAL_ADC_INJ_TRIG_SOFTWARE             = LL_ADC_INJ_TRIG_SOFTWARE,        /*!< ADC group injected conversion
                                        trigger from software start */
  HAL_ADC_INJ_TRIG_EXTI15               = LL_ADC_INJ_TRIG_EXTI15,          /*!< ADC group injected conversion
                                        trigger from external peripheral: EXTI line 15. */
  HAL_ADC_INJ_TRIG_TIM1_OC4             = LL_ADC_INJ_TRIG_TIM1_OC4,        /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM1 channel 4 . */
  HAL_ADC_INJ_TRIG_TIM1_TRGO            = LL_ADC_INJ_TRIG_TIM1_TRGO,       /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM1 TRGO */
  HAL_ADC_INJ_TRIG_TIM1_TRGO2           = LL_ADC_INJ_TRIG_TIM1_TRGO2,      /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM1 TRGO2 */
  HAL_ADC_INJ_TRIG_TIM2_OC1             = LL_ADC_INJ_TRIG_TIM2_OC1,        /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM2 channel 1 . */
  HAL_ADC_INJ_TRIG_TIM2_TRGO            = LL_ADC_INJ_TRIG_TIM2_TRGO,       /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM2 TRGO */
#if defined(STM32C591xx) || defined(STM32C593xx) || defined(STM32C5A3xx)
  HAL_ADC_INJ_TRIG_TIM3_TRGO            = LL_ADC_INJ_TRIG_TIM3_TRGO,       /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM3 TRGO */
  HAL_ADC_INJ_TRIG_TIM3_OC1             = LL_ADC_INJ_TRIG_TIM3_OC1,        /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM3 channel 1 . */
  HAL_ADC_INJ_TRIG_TIM3_OC3             = LL_ADC_INJ_TRIG_TIM3_OC3,        /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM3 channel 1 . */
  HAL_ADC_INJ_TRIG_TIM4_TRGO            = LL_ADC_INJ_TRIG_TIM4_TRGO,       /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM4 TRGO */
#endif /* STM32C591xx, STM32C593xx, STM32C5A3xx */
  HAL_ADC_INJ_TRIG_TIM5_OC1             = LL_ADC_INJ_TRIG_TIM5_OC1,        /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM5 channel 1 . */
  HAL_ADC_INJ_TRIG_TIM5_OC2             = LL_ADC_INJ_TRIG_TIM5_OC2,        /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM5 channel 2 . */
  HAL_ADC_INJ_TRIG_TIM5_OC3             = LL_ADC_INJ_TRIG_TIM5_OC3,        /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM5 channel 3 . */
  HAL_ADC_INJ_TRIG_TIM5_TRGO            = LL_ADC_INJ_TRIG_TIM5_TRGO,       /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM5 TRGO */
  HAL_ADC_INJ_TRIG_TIM7_TRGO            = LL_ADC_INJ_TRIG_TIM7_TRGO,       /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM7 TRGO */
  HAL_ADC_INJ_TRIG_TIM8_OC4             = LL_ADC_INJ_TRIG_TIM8_OC4,        /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM8 TRGO */
  HAL_ADC_INJ_TRIG_TIM8_TRGO            = LL_ADC_INJ_TRIG_TIM8_TRGO,       /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM8 TRGO */
  HAL_ADC_INJ_TRIG_TIM8_TRGO2           = LL_ADC_INJ_TRIG_TIM8_TRGO2,      /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM8 TRGO2 */
  HAL_ADC_INJ_TRIG_TIM12_TRGO           = LL_ADC_INJ_TRIG_TIM12_TRGO,      /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM12 TRGO */
  HAL_ADC_INJ_TRIG_TIM15_TRGO           = LL_ADC_INJ_TRIG_TIM15_TRGO,      /*!< ADC group injected conversion
                                        trigger from external peripheral: TIM15 TRGO */
#if defined(LPTIM1)
  HAL_ADC_INJ_TRIG_LPTIM1_OC1           = LL_ADC_INJ_TRIG_LPTIM1_OC1,      /*!< ADC group injected conversion
                                        trigger from external peripheral: LPTIM1 channel 1 */
#endif /* LPTIM1 */
  HAL_ADC_INJ_TRIG_FROM_REGULAR         = LL_ADC_INJ_TRIG_FROM_REGULAR     /*!< ADC group injected conversion
                                        trigger from ADC group regular end of sequence (no action ADC group injected
                                        conversion start or stop).
                                        Intended usage: extend ADC group regular sequencer length. */
} hal_adc_inj_trig_src_t;

/**
  * @brief HAL ADC group injected conversion trigger edge
  */
typedef enum
{
  HAL_ADC_INJ_TRIG_EDGE_NONE            = 0x00000000UL,                      /*!< ADC group injected conversion
                                        trigger disabled (SW start) */
  HAL_ADC_INJ_TRIG_EDGE_RISING          = LL_ADC_INJ_TRIG_RISING,        /*!< ADC group injected conversion
                                        trigger polarity set to rising edge */
  HAL_ADC_INJ_TRIG_EDGE_FALLING         = LL_ADC_INJ_TRIG_FALLING,       /*!< ADC group injected conversion
                                        trigger polarity set to falling edge */
  HAL_ADC_INJ_TRIG_EDGE_RISING_FALLING  = LL_ADC_INJ_TRIG_RISING_FALLING, /*!< ADC group injected conversion
                                        trigger polarity set to both rising and falling edges */
} hal_adc_inj_trig_edge_t;

