MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.h
/**
  * @brief HAL ADC group injected sequencer scan discontinuous length
  */
typedef enum
{
  HAL_ADC_INJ_SEQ_DISCONT_DISABLE       = LL_ADC_INJ_SEQ_DISCONT_DISABLE, /*!< ADC group injected sequencer
                                        discontinuous mode disabled */
  HAL_ADC_INJ_SEQ_DISCONT_1RANK         = LL_ADC_INJ_SEQ_DISCONT_1RANK,   /*!< ADC group injected sequencer
                                        discontinuous mode enabled with sequence interruption every rank */
} hal_adc_inj_seq_discont_length_t;

/**
  * @brief HAL ADC channel
  */
typedef enum
{
  HAL_ADC_CHANNEL_0                     = LL_ADC_CHANNEL_0,          /*!< ADC channel to GPIO pin ADCx_IN0  */
  HAL_ADC_CHANNEL_1                     = LL_ADC_CHANNEL_1,          /*!< ADC channel to GPIO pin ADCx_IN1  */
  HAL_ADC_CHANNEL_2                     = LL_ADC_CHANNEL_2,          /*!< ADC channel to GPIO pin ADCx_IN2  */
  HAL_ADC_CHANNEL_3                     = LL_ADC_CHANNEL_3,          /*!< ADC channel to GPIO pin ADCx_IN3  */
  HAL_ADC_CHANNEL_4                     = LL_ADC_CHANNEL_4,          /*!< ADC channel to GPIO pin ADCx_IN4  */
  HAL_ADC_CHANNEL_5                     = LL_ADC_CHANNEL_5,          /*!< ADC channel to GPIO pin ADCx_IN5  */
  HAL_ADC_CHANNEL_6                     = LL_ADC_CHANNEL_6,          /*!< ADC channel to GPIO pin ADCx_IN6  */
  HAL_ADC_CHANNEL_7                     = LL_ADC_CHANNEL_7,          /*!< ADC channel to GPIO pin ADCx_IN7  */
  HAL_ADC_CHANNEL_8                     = LL_ADC_CHANNEL_8,          /*!< ADC channel to GPIO pin ADCx_IN8  */
  HAL_ADC_CHANNEL_9                     = LL_ADC_CHANNEL_9,          /*!< ADC channel to GPIO pin ADCx_IN9  */
  HAL_ADC_CHANNEL_10                    = LL_ADC_CHANNEL_10,         /*!< ADC channel to GPIO pin ADCx_IN10 */
  HAL_ADC_CHANNEL_11                    = LL_ADC_CHANNEL_11,         /*!< ADC channel to GPIO pin ADCx_IN11 */
  HAL_ADC_CHANNEL_12                    = LL_ADC_CHANNEL_12,         /*!< ADC channel to GPIO pin ADCx_IN12 */
  HAL_ADC_CHANNEL_13                    = LL_ADC_CHANNEL_13,         /*!< ADC channel to GPIO pin ADCx_IN13 */
  HAL_ADC_CHANNEL_VREFINT               = LL_ADC_CHANNEL_VREFINT,    /*!< ADC channel to VrefInt (internal
                                        voltage reference) */
  HAL_ADC_CHANNEL_TEMPSENSOR            = LL_ADC_CHANNEL_TEMPSENSOR, /*!< ADC channel to internal temperature
                                        sensor. */
  HAL_ADC_CHANNEL_NONE                  = LL_ADC_CHANNEL_NONE,       /*!< No ADC channel selected (usable only
                                        by specific functions: analog watchdog configuration) */
  HAL_ADC_CHANNEL_ALL                   = LL_ADC_CHANNEL_ALL,        /*!< All ADC channels selected (usable only
                                        by specific functions: analog watchdog configuration) */
} hal_adc_channel_t;

/**
  * @brief HAL ADC sampling time (channel wise)
  */
typedef enum
{
  HAL_ADC_SAMPLING_TIME_3CYCLES         = LL_ADC_SAMPLINGTIME_3CYCLES,     /*!< Sampling time 3 ADC clock cycles */
  HAL_ADC_SAMPLING_TIME_5CYCLES         = LL_ADC_SAMPLINGTIME_5CYCLES,     /*!< Sampling time 5 ADC clock cycles */
  HAL_ADC_SAMPLING_TIME_8CYCLES         = LL_ADC_SAMPLINGTIME_8CYCLES,     /*!< Sampling time 8 ADC clock cycles */
  HAL_ADC_SAMPLING_TIME_13CYCLES        = LL_ADC_SAMPLINGTIME_13CYCLES,    /*!< Sampling time 13 ADC clock cycles */
  HAL_ADC_SAMPLING_TIME_25CYCLES        = LL_ADC_SAMPLINGTIME_25CYCLES,    /*!< Sampling time 25 ADC clock cycles */
  HAL_ADC_SAMPLING_TIME_48CYCLES        = LL_ADC_SAMPLINGTIME_48CYCLES,    /*!< Sampling time 45 ADC clock cycles */
  HAL_ADC_SAMPLING_TIME_139CYCLES       = LL_ADC_SAMPLINGTIME_139CYCLES,   /*!< Sampling time 139 ADC clock cycles */
  HAL_ADC_SAMPLING_TIME_289CYCLES       = LL_ADC_SAMPLINGTIME_289CYCLES    /*!< Sampling time 289 ADC clock cycles */
} hal_adc_sampling_time_t;

/**
  * @brief HAL ADC channel input mode (single, differential ended)
  */
typedef enum
{
  HAL_ADC_IN_SINGLE_ENDED               = LL_ADC_IN_SINGLE_ENDED, /*!< ADC channel input set to single-ended */
} hal_adc_in_mode_t;

/**
  * @brief HAL ADC analog watchdog instance.
  * @note  Analog watchdog instances specificities:
  *        - AWD standard (instance AWD1):
  *          - channels monitored: can monitor 1 channel or all channels.
  *          - groups monitored: ADC groups regular and-or injected.
  *          - resolution: resolution is not limited (corresponds to ADC resolution configured).
  *        - AWD flexible (instances AWD2, AWD3):
  *          - channels monitored: flexible on channels monitored, selection is channel wise,
  *            from from 1 to all channels.
  *          - groups monitored: no selection possible (monitoring on both groups regular and injected).
  */
typedef enum
{
  HAL_ADC_AWD_1                         = LL_ADC_AWD_1, /*!< ADC analog watchdog number 1 */
  HAL_ADC_AWD_2                         = LL_ADC_AWD_2, /*!< ADC analog watchdog number 2 */
  HAL_ADC_AWD_3                         = LL_ADC_AWD_3  /*!< ADC analog watchdog number 3 */
} hal_adc_awd_instance_t;

/**
  * @brief HAL ADC analog watchdog threshold selection
  */
typedef enum
{
  HAL_ADC_AWD_THRESHOLD_HIGH            = LL_ADC_AWD_THRESHOLD_HIGH, /*!< ADC analog watchdog threshold high */
  HAL_ADC_AWD_THRESHOLD_LOW             = LL_ADC_AWD_THRESHOLD_LOW,  /*!< ADC analog watchdog threshold low */
} hal_adc_awd_threshold_sel_t;

/**
  * @brief HAL ADC analog watchdog filtering
  */
typedef enum
{
  HAL_ADC_AWD_FILTERING_NONE            = LL_ADC_AWD_FILTERING_NONE,     /*!< ADC analog watchdog no filtering, one
                                        out-of-window sample triggers flag raise */
  HAL_ADC_AWD_FILTERING_2SAMPLES        = LL_ADC_AWD_FILTERING_2SAMPLES, /*!< ADC analog watchdog 2 consecutives
                                        out-of-window samples trigger flag raise */
  HAL_ADC_AWD_FILTERING_3SAMPLES        = LL_ADC_AWD_FILTERING_3SAMPLES, /*!< ADC analog watchdog 3 consecutives
                                        out-of-window samples trigger flag raise */
  HAL_ADC_AWD_FILTERING_4SAMPLES        = LL_ADC_AWD_FILTERING_4SAMPLES, /*!< ADC analog watchdog 4 consecutives
                                        out-of-window samples trigger flag raise */
  HAL_ADC_AWD_FILTERING_5SAMPLES        = LL_ADC_AWD_FILTERING_5SAMPLES, /*!< ADC analog watchdog 5 consecutives
                                        out-of-window samples trigger flag raise */
  HAL_ADC_AWD_FILTERING_6SAMPLES        = LL_ADC_AWD_FILTERING_6SAMPLES, /*!< ADC analog watchdog 6 consecutives
                                        out-of-window samples trigger flag raise */
  HAL_ADC_AWD_FILTERING_7SAMPLES        = LL_ADC_AWD_FILTERING_7SAMPLES, /*!< ADC analog watchdog 7 consecutives
                                        out-of-window samples trigger flag raise */
  HAL_ADC_AWD_FILTERING_8SAMPLES        = LL_ADC_AWD_FILTERING_8SAMPLES /*!< ADC analog watchdog 8 consecutives
                                        out-of-window samples trigger flag raise */
} hal_adc_awd_filtering_t;

/**
  * @brief HAL ADC oversampling instance
  */
typedef enum
{
  HAL_ADC_OVS_1                         = LL_ADC_OVS_1, /*!< ADC oversampling instance for standard oversampling:
                                        a single oversampling accumulator is common to regular and injected conversions.
                                        Therefore, settings ratio and shift are common and process is sequential.
                                        For constraints of oversampling on groups regular and injected,
                                        refer to parameters of @ref hal_adc_ovs_scope_t. */
} hal_adc_ovs_instance_t;

/**
  * @brief HAL ADC oversampling scope
  */
typedef enum
{
  HAL_ADC_OVS_DISABLE                   = LL_ADC_OVS_DISABLE, /*!< ADC oversampling disabled. */
  HAL_ADC_OVS_REG_CONTINUED             = LL_ADC_OVS_REG_CONTINUED, /*!< ADC oversampling on conversions of
                                        ADC group regular.
                                        If ADC group injected conversion insertion within regular sequence: oversampling
                                        on group regular is temporary stopped and, after injected conversion, continued
                                        (oversampling accumulator maintained). */
  HAL_ADC_OVS_REG_RESUMED               = LL_ADC_OVS_REG_RESUMED, /*!< ADC oversampling on conversions of
                                        ADC group regular.
                                        If ADC group injected conversion insertion within regular sequence: after
                                        injected conversion, oversampling on group regular is resumed from start
                                        (oversampler accumulator reset). */
  HAL_ADC_OVS_INJ                       = LL_ADC_OVS_INJ, /*!< ADC oversampling on conversions of
                                        ADC group injected, in sequential mode:
                                        oversampling conversions sequence sequential, switching data registers
                                        after each oversampling process (all ratio occurrences, shift).
                                        Note: A single oversampling accumulator is common to regular
                                              and injected conversions. Therefore, settings ratio and shift are common
                                              and process is sequential. */
  HAL_ADC_OVS_INJ_REG_RESUMED           = LL_ADC_OVS_INJ_REG_RESUMED, /*!< ADC oversampling on conversions
                                        of ADC groups regular and injected.
                                        Combination of LL_ADC_OVS_REG_RESUMED and LL_ADC_OVS_INJ: refer to
                                        description of these parameters. */
} hal_adc_ovs_scope_t;

/**
  * @brief HAL ADC oversampling discontinuous mode
  */
typedef enum
{
  HAL_ADC_OVS_CONT                      = LL_ADC_OVS_CONT,   /*!< ADC oversampling discontinuous mode: continuous
                                        (all conversions of oversampling ratio start from 1 trigger) */
  HAL_ADC_OVS_DISCONT                   = LL_ADC_OVS_DISCONT /*!< ADC oversampling discontinuous mode: discontinuous
                                        (each conversion of oversampling ratio needs a trigger).
                                        Note: Discontinuous mode applied only on group regular oversampling
                                              (not injected oversampling). */
} hal_adc_ovs_discont_t;

/**
  * @brief HAL ADC offset instance
  */
typedef enum
{
  HAL_ADC_OFFSET_1                      = LL_ADC_OFFSET_1, /*!< ADC offset instance 1: ADC channel and offset level
                                        to which the offset programmed will be applied (independently of channel
                                        assigned on ADC group regular or injected sequencer) */
  HAL_ADC_OFFSET_2                      = LL_ADC_OFFSET_2, /*!< ADC offset instance 2: ADC channel and offset level
                                        to which the offset programmed will be applied (independently of channel
                                        assigned on ADC group regular or injected sequencer) */
  HAL_ADC_OFFSET_3                      = LL_ADC_OFFSET_3, /*!< ADC offset instance 3: ADC channel and offset level
                                        to which the offset programmed will be applied (independently of channel
                                        assigned on ADC group regular or injected sequencer) */
  HAL_ADC_OFFSET_4                      = LL_ADC_OFFSET_4, /*!< ADC offset instance 4: ADC channel and offset level
                                        to which the offset programmed will be applied (independently of channel
                                        assigned on ADC group regular or injected sequencer) */
} hal_adc_offset_instance_t;

/**
  * @brief HAL ADC offset signed saturation
  */
typedef enum
{
  HAL_ADC_OFFSET_SAT_SIGNED_DISABLE     = LL_ADC_OFFSET_SIGNED_SATURATION_DISABLE, /*!< ADC offset signed saturation
                                        disabled */
  HAL_ADC_OFFSET_SAT_SIGNED_ENABLE      = LL_ADC_OFFSET_SIGNED_SATURATION_ENABLE   /*!< ADC offset signed saturation
                                        enabled */
} hal_adc_offset_sat_sign_state_t;

/**
  * @brief HAL ADC offset unsigned saturation
  */
typedef enum
{
  HAL_ADC_OFFSET_SAT_UNSIGNED_DISABLE   = LL_ADC_OFFSET_UNSIGNED_SATURATION_DISABLE, /*!< ADC offset unsigned saturation
                                        disabled */
  HAL_ADC_OFFSET_SAT_UNSIGNED_ENABLE    = LL_ADC_OFFSET_UNSIGNED_SATURATION_ENABLE   /*!< ADC offset unsigned saturation
                                        enabled */
} hal_adc_offset_sat_unsign_state_t;

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief HAL ADC multimode - Instances
  */
typedef enum
{
  HAL_ADC_MM_MASTER                     = LL_ADC_MULTI_MASTER,      /*!< Multimode ADC instance selection: ADC master */
  HAL_ADC_MM_SLAVE                      = LL_ADC_MULTI_SLAVE,       /*!< Multimode ADC instance selection: ADC slave */
  HAL_ADC_MM_MASTER_SLAVE               = LL_ADC_MULTI_MASTER_SLAVE /*!< Multimode ADC instance selection: both
                                        ADC master and ADC slave */
} hal_adc_mm_inst_t;

/**
  * @brief HAL ADC multimode - Mode
  */
typedef enum
{
  HAL_ADC_MM_INDEPENDENT                = LL_ADC_MULTI_INDEPENDENT,          /*!< ADC dual mode disabled
                                        (ADC independent mode) */
  HAL_ADC_MM_DUAL_REG_SIMULT            = LL_ADC_MULTI_DUAL_REG_SIMULT,      /*!< ADC dual mode group regular
                                        simultaneous */
  HAL_ADC_MM_DUAL_REG_INTERL            = LL_ADC_MULTI_DUAL_REG_INTERL,      /*!< ADC dual mode group regular
                                        interleaved */
  HAL_ADC_MM_DUAL_INJ_SIMULT            = LL_ADC_MULTI_DUAL_INJ_SIMULT,      /*!< ADC dual mode group injected
                                        simultaneous */
  HAL_ADC_MM_DUAL_INJ_ALTERN            = LL_ADC_MULTI_DUAL_INJ_ALTERN,      /*!< ADC dual mode group injected
                                        alternate trigger. Works only with external triggers (not SW start) */
  HAL_ADC_MM_DUAL_REG_SIM_INJ_SIM       = LL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM, /*!< ADC dual mode combined group regular
                                        simultaneous + group injected simultaneous */
  HAL_ADC_MM_DUAL_REG_SIM_INJ_ALT       = LL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT, /*!< ADC dual mode combined group regular
                                        simultaneous + group injected alternate trigger */
  HAL_ADC_MM_DUAL_REG_INT_INJ_SIM       = LL_ADC_MULTI_DUAL_REG_INT_INJ_SIM, /*!< ADC dual mode combined group regular
                                        interleaved + group injected simultaneous */
} hal_adc_mm_mode_t;

/**
  * @brief HAL ADC multimode - Data format
  */
typedef enum
{
  HAL_ADC_MM_REG_DATA_EACH_ADC          = LL_ADC_MULTI_REG_DMA_EACH_ADC,   /*!< ADC multimode group regular
                                        data format: full range, no data packing.
                                        Intended for cases:
                                        - multimode without DMA transfer
                                        - multimode with DMA transfer in two different buffers.
                                        - high data width (can exceed ADC resolution in case of
                                          oversampling or post-processing: offset, ...) over data packing constraints.
                                        For no data transfer:
                                        - to retrieve conversion data, use @ref HAL_ADC_REG_ReadConversionData() with
                                          each ADC instance.
                                        For data transfer by DMA:
                                        - use function @ref HAL_ADC_MM_REG_StartConvM_DMA().
                                          Each ADC uses its own DMA channel, with its individual DMA transfer
                                          settings. Therefore, two destination buffers. */
  HAL_ADC_MM_REG_DATA_PACK_32_BITS      = LL_ADC_MULTI_REG_DMA_RES_32_16B, /*!< ADC multimode group regular
                                        data format: full range (no packing) and 2 data packing on 32 bits.
                                        Intended for cases:
                                        - multimode with DMA transfer in a single buffer.
                                        - high data width (can exceed ADC resolution in case of
                                          oversampling or post-processing: offset, ...) over data packing constraints.
                                        For no data transfer:
                                        - to retrieve conversion data, use @ref HAL_ADC_MM_REG_ReadConversionData()
                                          or @ref HAL_ADC_REG_ReadConversionData() with each ADC instance.
                                        For data transfer by DMA:
                                        - with data packing on 32 bits: ADC master and slave data are concatenated
                                          (data master in [15; 0], data slave in [31; 16]),
                                          therefore data width must be lower than 16 bits.
                                          Use parameter hal_adc_mm_reg_data_transfer_pack_t
                                          value @ref HAL_ADC_MM_REG_DATA_TRANSFER_PACK.
                                        - with no data packing: data of master and slave are alternatively set in full
                                          register width 32 bits, therefore no constraint on data width.
                                          Use parameter hal_adc_mm_reg_data_transfer_pack_t
                                          value @ref HAL_ADC_MM_REG_DATA_TRANSFER_UNPACK. */
  HAL_ADC_MM_REG_DATA_PACK_16_BITS      = LL_ADC_MULTI_REG_DMA_RES_8B      /*!< ADC multimode group regular
                                        data format: full range (no packing) and 2 data packing on 16 bits.
                                        Intended for cases:
                                        - multimode with DMA transfer in a single buffer with elements 16 bits.
                                        For no data transfer:
                                        - to retrieve conversion data, use @ref HAL_ADC_REG_ReadConversionData() with
                                          each ADC instance.
                                        For data transfer by DMA:
                                        - with data packing on 16 bits: ADC master and slave data are concatenated
                                          (data master in [7; 0], data slave in [15; 8]),
                                          therefore data width must be lower than 8 bits.
                                          Use parameter hal_adc_mm_reg_data_transfer_pack_t
                                          value @ref HAL_ADC_MM_REG_DATA_TRANSFER_PACK.
                                        - with no data packing: same as setting HAL_ADC_MM_REG_DATA_PACK_32_BITS. */
} hal_adc_mm_reg_data_format_t;

