MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.h
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
/**
  * @brief HAL ADC multimode - Data transfer
  */
typedef enum
{
  HAL_ADC_MM_REG_DATA_TRANSFER_PACK     = LL_ADC_DMA_REG_MM_REGULAR_PACK_DATA, /*!< ADC multimode group regular
                                        data transfer by DMA with packing: data transfer is performed
                                        every 2 conversions of ADC instances part of multimode.
                                        Therefore, for dual mode, destination buffer each element is composed
                                        of data from ADC master and ADC slave concatenated (buffer size equal to
                                        size of each ADC expected number of conversions).
                                        Concatenation format: refer to @ref hal_adc_mm_reg_data_format_t.
                                        Benefit: Number of DMA requests reduced.
                                        Limitation: Setting not compliant with all data width (can exceed ADC
                                        resolution in case of oversampling or post-processing: offset, ...).*/
  HAL_ADC_MM_REG_DATA_TRANSFER_UNPACK   = LL_ADC_DMA_REG_MM_REGULAR_UNPACK_DATA, /*!< ADC multimode group regular
                                        data transfer by DMA without packing: data transfer is performed
                                        for each conversion of ADC instances part of multimode.
                                        Therefore, for dual mode, destination buffer each element is composed
                                        alternatively of data from ADC master and ADC slave (buffer size must be twice
                                        the size of each ADC expected number of conversions).
                                        Benefit: Setting compliant with all data width (can exceed ADC
                                        resolution in case of oversampling or post-processing: offset, ...). */
} hal_adc_mm_reg_data_transfer_pack_t;
#endif /* USE_HAL_ADC_DMA */

/**
  * @brief HAL ADC multimode - Delay between two sampling phases (for mode interleaved)
  */
typedef enum
{
  HAL_ADC_MM_INTERL_DELAY_1CYCLE        = LL_ADC_MULTI_TWOSMP_DELAY_1CYCLE,   /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 1 ADC clock cycle for all resolutions */
  HAL_ADC_MM_INTERL_DELAY_2CYCLES       = LL_ADC_MULTI_TWOSMP_DELAY_2CYCLES,  /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 2 ADC clock cycles for all resolutions */
  HAL_ADC_MM_INTERL_DELAY_3CYCLES       = LL_ADC_MULTI_TWOSMP_DELAY_3CYCLES,  /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 3 ADC clock cycles for all resolutions */
  HAL_ADC_MM_INTERL_DELAY_4CYCLES       = LL_ADC_MULTI_TWOSMP_DELAY_4CYCLES,  /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 4 ADC clock cycles for all resolutions */
  HAL_ADC_MM_INTERL_DELAY_5CYCLES       = LL_ADC_MULTI_TWOSMP_DELAY_5CYCLES,  /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 5 ADC clock cycles for all resolutions */
  HAL_ADC_MM_INTERL_DELAY_6CYCLES       = LL_ADC_MULTI_TWOSMP_DELAY_6CYCLES,  /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 6 ADC clock cycles for all resolutions */
  HAL_ADC_MM_INTERL_DELAY_7CYCLES       = LL_ADC_MULTI_TWOSMP_DELAY_7CYCLES,  /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 7 ADC clock cycles for all resolutions */
  HAL_ADC_MM_INTERL_DELAY_8CYCLES       = LL_ADC_MULTI_TWOSMP_DELAY_8CYCLES,  /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 8 ADC clock cycles for resolutions
                                        12, 10, 8 bit */
  HAL_ADC_MM_INTERL_DELAY_9CYCLES       = LL_ADC_MULTI_TWOSMP_DELAY_9CYCLES,  /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 9 ADC clock cycles for resolutions
                                        12, 10, 8 bit */
  HAL_ADC_MM_INTERL_DELAY_10CYCLES      = LL_ADC_MULTI_TWOSMP_DELAY_10CYCLES, /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 10 ADC clock cycles for resolutions
                                        12, 10 bit */
  HAL_ADC_MM_INTERL_DELAY_11CYCLES      = LL_ADC_MULTI_TWOSMP_DELAY_11CYCLES, /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 11 ADC clock cycles for resolutions
                                        12, 10 bit */
  HAL_ADC_MM_INTERL_DELAY_12CYCLES      = LL_ADC_MULTI_TWOSMP_DELAY_12CYCLES, /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 12 ADC clock cycles for resolution 12 bit */
  HAL_ADC_MM_INTERL_DELAY_13CYCLES      = LL_ADC_MULTI_TWOSMP_DELAY_13CYCLES, /*!< ADC multimode (mode interleaved)
                                        delay between two sampling phases: 13 ADC clock cycles for resolution 12 bit */
} hal_adc_mm_interl_delay_t;

#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @brief HAL ADC events
  */
typedef enum
{
  HAL_ADC_EVENT_EOC                     = LL_ADC_FLAG_EOC,    /*!< ADC event group regular end of unitary conversion */
  HAL_ADC_EVENT_EOS                     = LL_ADC_FLAG_EOS,    /*!< ADC event group regular end of sequence
                                        conversions */
  HAL_ADC_EVENT_OVR                     = LL_ADC_FLAG_OVR,    /*!< ADC event group regular overrun */
  HAL_ADC_EVENT_EOSMP                   = LL_ADC_FLAG_EOSMP,  /*!< ADC event group regular end of sampling phase */
  HAL_ADC_EVENT_JEOC                    = LL_ADC_FLAG_JEOC,   /*!< ADC event group injected end of unitary conversion */
  HAL_ADC_EVENT_JEOS                    = LL_ADC_FLAG_JEOS,   /*!< ADC event group injected end of sequence
                                        conversions */
  HAL_ADC_EVENT_AWD_1                   = LL_ADC_FLAG_AWD1,   /*!< ADC event analog watchdog 1 */
  HAL_ADC_EVENT_AWD_2                   = LL_ADC_FLAG_AWD2,   /*!< ADC event analog watchdog 2 */
  HAL_ADC_EVENT_AWD_3                   = LL_ADC_FLAG_AWD3,   /*!< ADC event analog watchdog 3 */
} hal_adc_event_t;

/**
  * @brief ADC instance configuration
  */
typedef struct
{
  hal_adc_resolution_t                  resolution;         /*!< ADC resolution */
  hal_adc_sampling_mode_t               sampling_mode;      /*!< ADC sampling mode */
} hal_adc_config_t;

/**
  * @brief ADC instance configuration advanced: conversion data post processing
  */
typedef struct
{
  hal_adc_left_bit_shift_t              left_bit_shift;          /*!< ADC data post-processing: left bit shift
                                        for ADC groups regular and injected conversions. */
  uint32_t                              gain_compensation_x1000; /*!< ADC data post-processing: ADC gain coefficient
                                        applied to raw conversions data. Value multiplied by 1000 to have an integer
                                        value (example: to set coefficient 0.982, parameter value must be 982).
                                        Therefore, unitary gain corresponds to value 1000.
                                        Can be a number between: Min_Data = 0, Max_Data = 3999.
                                        Note: Coefficient resolution managed by ADC peripheral is higher than 1/1000,
                                              if needed to reach more accurate resolution, refer to function
                                              LL_ADC_SetGainCompensation().
                                        Note: Applies to ADC groups regular and injected conversions. */
} hal_adc_post_processing_config_t;

/**
  * @brief ADC instance configuration advanced: low power features
  */
typedef struct
{
  hal_adc_lp_auto_wait_state_t          lp_auto_wait;       /*!< ADC low power feature autowait */
} hal_adc_low_power_config_t;

/**
  * @brief ADC calibration data
  */
typedef struct
{
  uint32_t                              factors[HAL_ADC_CALIB_FACTORS_BUF_SIZE]; /*!< ADC calibration factors buffer */
} hal_adc_calib_t;

/**
  * @brief ADC group regular configuration
  */
typedef struct
{
  hal_adc_reg_trig_src_t                trigger_src;        /*!< ADC group regular conversion trigger source */
  hal_adc_reg_trig_edge_t               trigger_edge;       /*!< ADC group regular conversion trigger edge */
  uint8_t                               sequencer_length;   /*!< ADC group regular sequencer scan length.
                                                             Min_Data = 1, Max_Data = 16 */
  hal_adc_reg_seq_discont_length_t      sequencer_discont;  /*!< ADC group regular sequencer scan discontinuous length */
  hal_adc_reg_continuous_mode_t         continuous;         /*!< ADC group regular continuous mode */
  hal_adc_reg_overrun_mode_t            overrun;            /*!< ADC group regular overrun mode */
} hal_adc_reg_config_t;

/**
  * @brief ADC group injected configuration
  */
typedef struct
{
  hal_adc_inj_trig_src_t                trigger_src;        /*!< ADC group injected conversion trigger source */
  hal_adc_inj_trig_edge_t               trigger_edge;       /*!< ADC group injected conversion trigger edge */
  uint8_t                               sequencer_length;   /*!< ADC group injected sequencer scan length.
                                        Can be a number between Min_Data = 1, Max_Data = 4 */
  hal_adc_inj_seq_discont_length_t      sequencer_discont;  /*!< ADC group injected sequencer scan
                                        discontinuous length */
} hal_adc_inj_config_t;

/**
  * @brief ADC channel configuration
  */
typedef struct
{
  hal_adc_group_t                       group;              /*!< ADC group in which set the channel */
  uint8_t                               sequencer_rank;     /*!< ADC group sequencer rank (position in conversions
                                        sequence)
                                        Can be a number in range of parameter "sequencer_length" in
                                        structures hal_adc_reg_config_t and hal_adc_inj_config_t:
                                        Min_Data = 1, Max_Data = {4; 16} depending on ADC group */
  hal_adc_sampling_time_t               sampling_time;      /*!< Sampling time */
  hal_adc_in_mode_t                     input_mode;         /*!< ADC channel input mode (single, differential ended) */
} hal_adc_channel_config_t;

/**
  * @brief ADC analog watchdog configuration.
  * @note  To use analog watchdog with interruption, start ADC conversion with optional interruption
  *        (HAL_ADC_xxx_StartConv_IT_Opt() or HAL_ADC_xxx_StartConv_DMA_Opt())
  *        and parameter HAL_ADC_OPT_IT_xxx_AWDx.
  */
typedef struct
{
  hal_adc_group_t                       group;              /*!< ADC group from which conversion data is compared
                                        to thresholds.
                                        Analog watchdog instances specificities impacting this parameter: refer to
                                        description of "hal_adc_awd_instance_t". */
  hal_adc_channel_t                     channel;            /*!< ADC channel to be monitored */
  int32_t                               threshold_high;     /*!< ADC analog watchdog threshold high value.
                                        Can be a number between Min_Data=-4194304 (two's complement 0xFFC00000)
                                        and Max_Data=+4194303 (0x003FFFFF)
                                        Note: Value is signed and can exceed ADC resolution with post-processing
                                              computation (offset, oversampling, data shift, ...).
                                        Note: To compute digital value from physical value (voltage), use helper macro
                                              @ref HAL_ADC_CALC_VOLTAGE_TO_DATA(). */
  int32_t                               threshold_low;     /*!< ADC analog watchdog threshold low value.
                                        Can be a number between Min_Data=-4194304 (two's complement 0xFFC00000)
                                        and Max_Data=+4194303 (0x003FFFFF)
                                        Note: Value is signed and can exceed ADC resolution with post-processing
                                              computation (offset, oversampling, data shift, ...).
                                        Note: To compute digital value from physical value (voltage), use helper macro
                                              @ref HAL_ADC_CALC_VOLTAGE_TO_DATA(). */
  hal_adc_awd_filtering_t               filtering;          /*!< ADC analog watchdog filtering
                                        (specific to AWD instance: AWD1) */
} hal_adc_awd_config_t;

/**
  * @brief ADC oversampling configuration
  */
typedef struct
{
  hal_adc_ovs_scope_t                   scope;              /*!< ADC oversampling scope */
  hal_adc_ovs_discont_t                 discont;            /*!< ADC oversampling discontinuous mode */
  uint16_t                              ratio;              /*!< ADC oversampling ratio: sum of conversions data
                                        computed to oversampling conversions data (before potential shift).
                                        Can be a number between Min_Data = 1, Max_Data = 1024 */
  uint8_t                               shift;              /*!< ADC oversampling shift: right bit shift
                                        Can be a number between Min_Data = 1, Max_Data = 10.
                                        Note: to compute shift value from ratio value and keeping data resolution,
                                              use function "HAL_ADC_GetOverSamplingShiftKeepRes()". */
} hal_adc_ovs_config_t;

/**
  * @brief ADC offset configuration
  */
typedef struct
{
  hal_adc_channel_t                     channel;            /*!< ADC channel with related conversion data to be processed */
  int32_t                               level;              /*!< ADC offset level to be subtracted or added
                                        to the raw ADC converted data.
                                        Value between Min_Data= -1*0x003FFFFF (two's complement 0xFFC00001)
                                        and Max_Data=0x003FFFFF.
                                        Note: Value is signed and can exceed ADC resolution with post-processing
                                              computation (offset, oversampling, data shift, ...).
                                        Note: To compute digital value from physical value (voltage), use helper macro
                                              @ref HAL_ADC_CALC_VOLTAGE_TO_DATA(). */
  hal_adc_offset_sat_sign_state_t      saturation_signed;  /*!< ADC offset signed saturation */
  hal_adc_offset_sat_unsign_state_t    saturation_unsigned; /*!< ADC offset unsigned saturation */
} hal_adc_offset_config_t;

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief ADC multimode configuration
  */
typedef struct
{
  hal_adc_mm_mode_t                     mode;               /*!< ADC multimode mode */
  hal_adc_mm_reg_data_format_t          reg_data_format;    /*!< ADC multimode group regular data format */
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  hal_adc_mm_reg_data_transfer_pack_t   reg_data_transfer_packing; /*!< ADC multimode group regular data transfer
                                        by DMA packing */
#endif /* USE_HAL_ADC_DMA */
  hal_adc_mm_interl_delay_t             interl_delay;       /*!< ADC multimode interleaved delay between two sampling
                                        phases (parameter applicable only for mode interleaved) */
} hal_adc_mm_config_t;

#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @brief HAL ADC Handle type definition
  */
typedef struct hal_adc_handle_s hal_adc_handle_t; /*!< ADC handle type definition */

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief HAL ADC pointers to callback functions
  */
typedef  void (*hal_adc_cb_t)(hal_adc_handle_t *hadc); /*!< pointer to ADC callback function */
typedef  void (*hal_adc_awd_cb_t)(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance); /*!< pointer to ADC
                                        analog watchdog callback function */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

/**
  * @brief ADC Handle Structure Definition
  */
struct hal_adc_handle_s
{
  hal_adc_t                             instance;             /*!< Peripheral instance */

