MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.h
#if defined(ADC_INST_IN_COMMON_COUNT) && (ADC_INST_IN_COMMON_COUNT > 1)
  hal_adc_handle_t                      *p_link_next_handle;    /*!< Pointer to another HAL ADC handle of instance
                                        belonging to the same ADC common instance (therefore, sharing common features).
                                        Used to access multiple HAL ADC handles (daisy chain: from one to
                                        another and circular).
                                        Set using function @ref HAL_ADC_SetLinkNextHandle(). */
#endif /* ADC_INST_IN_COMMON_COUNT */

  volatile hal_adc_state_t              global_state;         /*!< HAL ADC global state */
  volatile hal_adc_group_state_t        group_state[HAL_ADC_GROUPS_COUNT]; /*!< HAL ADC groups (regular, injected)
                                        state */
  volatile hal_adc_common_state_t       common_state;         /*!< HAL ADC handle link to common instance state */

  volatile hal_adc_group_conv_per_start_t group_conv_per_start[HAL_ADC_GROUPS_COUNT];  /*!< ADC group conversions per
                                        conversion start configuration */

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  hal_dma_handle_t                      *hdma_reg;            /*!< Pointer of DMA handle assigned to ADC group regular */
#if defined(ADC_MULTIMODE_SUPPORT)
  hal_adc_mm_reg_data_transfer_pack_t   mm_reg_data_transfer_packing; /*!< ADC multimode group regular data transfer
                                        by DMA packing */
#endif /* ADC_MULTIMODE_SUPPORT */
#endif /* USE_HAL_ADC_DMA */

#if defined(USE_HAL_ADC_USER_DATA) && (USE_HAL_ADC_USER_DATA == 1)
  const void                            *p_user_data;         /*!< User Data Pointer */
#endif /* USE_HAL_ADC_USER_DATA */

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  hal_adc_cb_t                          p_error_cb;           /*!< Callback function: Error */
  hal_adc_cb_t                          p_reg_end_of_sampling_cb; /*!< Callback function: ADC group regular end of
                                        sampling phase */
  hal_adc_cb_t                          p_reg_eoc_cb;         /*!< Callback function: ADC group regular end of
                                        unitary conversion */
  hal_adc_cb_t                          p_reg_eos_cb;         /*!< Callback function: ADC group regular end of
                                        sequence conversions */
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
  hal_adc_cb_t                          p_reg_xfer_half_cb;   /*!< Callback function: ADC group regular conversion data
                                        buffer half transfer */
  hal_adc_cb_t                          p_reg_xfer_cplt_cb;   /*!< Callback function: ADC group regular conversion data
                                        buffer transfer complete */
  hal_adc_cb_t                          p_reg_xfer_stop_cb;   /*!< Callback function: ADC group regular conversion data
                                        transfer abort */
#endif /* USE_HAL_ADC_DMA */
  hal_adc_cb_t                          p_inj_eoc_cb;         /*!< Callback function: ADC group injected end of
                                        unitary conversion */
  hal_adc_cb_t                          p_inj_eos_cb;         /*!< Callback function: ADC group injected end of
                                        sequence conversions */
  hal_adc_awd_cb_t                      p_awd_out_window_cb;  /*!< Callback function: ADC analog watchdog out of window
                                        event */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
  volatile uint32_t last_error_codes;   /*!< Last error codes (bitfields of @ref ADC_error_codes) */
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */
};

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup ADC_Exported_Functions ADC Exported Functions
  * @{
  */

/** @defgroup ADC_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */
hal_status_t HAL_ADC_Init(hal_adc_handle_t *hadc, hal_adc_t instance);
void HAL_ADC_DeInit(hal_adc_handle_t *hadc);

#if defined(ADC_INST_IN_COMMON_COUNT) && (ADC_INST_IN_COMMON_COUNT > 1)
hal_status_t HAL_ADC_SetLinkNextHandle(hal_adc_handle_t *hadc_a, hal_adc_handle_t *hadc_b);
#endif /* ADC_INST_IN_COMMON_COUNT */

#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
hal_status_t HAL_ADC_REG_SetDMA(hal_adc_handle_t *hadc, hal_dma_handle_t *hdma);
#endif /* USE_HAL_ADC_DMA */
/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group2_1 Configuration functions (mandatory features)
  * @{
  */
hal_status_t HAL_ADC_SetConfig(hal_adc_handle_t *hadc, const hal_adc_config_t *p_config);
void         HAL_ADC_GetConfig(const hal_adc_handle_t *hadc, hal_adc_config_t *p_config);

hal_status_t HAL_ADC_REG_SetConfig(hal_adc_handle_t *hadc, const hal_adc_reg_config_t *p_config);
void         HAL_ADC_REG_GetConfig(const hal_adc_handle_t *hadc, hal_adc_reg_config_t *p_config);

hal_status_t HAL_ADC_INJ_SetConfig(hal_adc_handle_t *hadc, const hal_adc_inj_config_t *p_config);
void         HAL_ADC_INJ_GetConfig(const hal_adc_handle_t *hadc, hal_adc_inj_config_t *p_config);

hal_status_t HAL_ADC_SetConfigChannel(hal_adc_handle_t *hadc, hal_adc_channel_t channel,
                                      const hal_adc_channel_config_t *p_config);
void HAL_ADC_GetConfigChannel(const hal_adc_handle_t *hadc, hal_adc_channel_t channel,
                              hal_adc_channel_config_t *p_config);

#if defined(ADC_MULTIMODE_SUPPORT)
hal_status_t HAL_ADC_MM_SetConfig(hal_adc_handle_t *hadc, const hal_adc_mm_config_t *p_config);
void         HAL_ADC_MM_GetConfig(const hal_adc_handle_t *hadc, hal_adc_mm_config_t *p_config);
hal_status_t HAL_ADC_MM_REG_SetMultiDMA(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte);
#endif /* ADC_MULTIMODE_SUPPORT */
/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group2_2 Configuration functions (optional features)
  * @{
  */
hal_status_t HAL_ADC_SetConfigPostProcessing(hal_adc_handle_t *hadc, const hal_adc_post_processing_config_t *p_config);
void         HAL_ADC_GetConfigPostProcessing(const hal_adc_handle_t *hadc, hal_adc_post_processing_config_t *p_config);
hal_status_t HAL_ADC_SetConfigLowPower(hal_adc_handle_t *hadc, const hal_adc_low_power_config_t *p_config);
void         HAL_ADC_GetConfigLowPower(const hal_adc_handle_t *hadc, hal_adc_low_power_config_t *p_config);

hal_status_t HAL_ADC_SetConfigAnalogWD(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                       const hal_adc_awd_config_t *p_config);
void         HAL_ADC_GetConfigAnalogWD(const hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                       hal_adc_awd_config_t *p_config);
hal_status_t HAL_ADC_SetAnalogWDThresholds(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                           hal_adc_awd_threshold_sel_t awd_threshold_sel, int32_t awd_threshold_value);
int32_t      HAL_ADC_GetAnalogWDThresholds(const hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                           hal_adc_awd_threshold_sel_t awd_threshold_sel);
hal_status_t HAL_ADC_SetAnalogWDChannel(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance,
                                        hal_adc_channel_t channel);
hal_adc_channel_t HAL_ADC_GetAnalogWDChannel(const hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance);

hal_status_t HAL_ADC_SetConfigOverSampling(hal_adc_handle_t *hadc, hal_adc_ovs_instance_t ovs_instance,
                                           const hal_adc_ovs_config_t *p_config);
void         HAL_ADC_GetConfigOverSampling(const hal_adc_handle_t *hadc, hal_adc_ovs_instance_t ovs_instance,
                                           hal_adc_ovs_config_t *p_config);
uint32_t     HAL_ADC_GetOverSamplingShiftKeepRes(uint32_t ratio);

hal_status_t HAL_ADC_SetConfigOffset(hal_adc_handle_t *hadc,  hal_adc_offset_instance_t offset_instance,
                                     const hal_adc_offset_config_t *p_config);
void         HAL_ADC_GetConfigOffset(const hal_adc_handle_t *hadc,  hal_adc_offset_instance_t offset_instance,
                                     hal_adc_offset_config_t *p_config);
hal_status_t HAL_ADC_SetOffsetLevel(hal_adc_handle_t *hadc, hal_adc_offset_instance_t offset_instance,
                                    int32_t offset_level);
int32_t      HAL_ADC_GetOffsetLevel(const hal_adc_handle_t *hadc, hal_adc_offset_instance_t offset_instance);
/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group3 IRQHandler and Callbacks functions
  * @{
  */
void HAL_ADC_IRQHandler(hal_adc_handle_t *hadc);
void HAL_ADC_IRQHandler_REG(hal_adc_handle_t *hadc);
void HAL_ADC_IRQHandler_INJ(hal_adc_handle_t *hadc);
void HAL_ADC_IRQHandler_AWD(hal_adc_handle_t *hadc);

void HAL_ADC_ErrorCallback(hal_adc_handle_t *hadc);
void HAL_ADC_REG_EndOfSamplingCallback(hal_adc_handle_t *hadc);
void HAL_ADC_REG_UnitaryConvCpltCallback(hal_adc_handle_t *hadc);
void HAL_ADC_REG_SequenceConvCpltCallback(hal_adc_handle_t *hadc);
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
void HAL_ADC_REG_DataTransferHalfCallback(hal_adc_handle_t *hadc);
void HAL_ADC_REG_DataTransferCpltCallback(hal_adc_handle_t *hadc);
void HAL_ADC_REG_DataTransferStopCallback(hal_adc_handle_t *hadc);
#endif /* USE_HAL_ADC_DMA */
void HAL_ADC_INJ_UnitaryConvCpltCallback(hal_adc_handle_t *hadc);
void HAL_ADC_INJ_SequenceConvCpltCallback(hal_adc_handle_t *hadc);
void HAL_ADC_AnalogWD_OutOfWindowCallback(hal_adc_handle_t *hadc, hal_adc_awd_instance_t awd_instance);

#if defined(USE_HAL_ADC_REGISTER_CALLBACKS) && (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
hal_status_t HAL_ADC_RegisterErrorCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
hal_status_t HAL_ADC_RegisterRegEndOfSamplingCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
hal_status_t HAL_ADC_RegisterRegUnitaryConvCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
hal_status_t HAL_ADC_RegisterRegSequenceConvCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
hal_status_t HAL_ADC_RegisterDataTransferHalfCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
hal_status_t HAL_ADC_RegisterDataTransferCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
hal_status_t HAL_ADC_RegisterDataTransferStopCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
#endif /* USE_HAL_ADC_DMA */
hal_status_t HAL_ADC_RegisterInjUnitaryConvCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
hal_status_t HAL_ADC_RegisterInjSequenceConvCpltCallback(hal_adc_handle_t *hadc, hal_adc_cb_t p_callback);
hal_status_t HAL_ADC_RegisterAwdOutOfWindowCallback(hal_adc_handle_t *hadc, hal_adc_awd_cb_t p_callback);
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group4 Peripheral state, errors, kernel clock frequency functions
  * @{
  */
hal_adc_state_t HAL_ADC_GetState(const hal_adc_handle_t *hadc);
hal_adc_group_state_t HAL_ADC_GetStateGroup(const hal_adc_handle_t *hadc, hal_adc_group_t group);
hal_adc_common_state_t HAL_ADC_GetStateCommon(const hal_adc_handle_t *hadc);
#if defined(USE_HAL_ADC_GET_LAST_ERRORS) && (USE_HAL_ADC_GET_LAST_ERRORS == 1)
uint32_t HAL_ADC_GetLastErrorCodes(const hal_adc_handle_t *hadc);
#endif /* USE_HAL_ADC_GET_LAST_ERRORS */
uint32_t HAL_ADC_GetClockFreq(const hal_adc_handle_t *hadc);
/**
  * @}
  */

