MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_adc.h
/** @defgroup ADC_Exported_Functions_Group5 Process functions
  * @{
  */
hal_status_t HAL_ADC_Start(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_Stop(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_Calibrate(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_GetCalibrationFactor(hal_adc_handle_t *hadc, hal_adc_calib_t *p_calib);
hal_status_t HAL_ADC_SetCalibrationFactor(hal_adc_handle_t *hadc, const hal_adc_calib_t *p_calib);
hal_status_t HAL_ADC_PollForEvent(hal_adc_handle_t *hadc, hal_adc_event_t event, uint32_t timeout_ms);

hal_status_t HAL_ADC_REG_StartConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_REG_StartConv_IT(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_REG_StartConv_IT_Opt(hal_adc_handle_t *hadc, uint32_t it_opt);
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
hal_status_t HAL_ADC_REG_StartConv_DMA(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte);
hal_status_t HAL_ADC_REG_StartConv_DMA_Opt(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte,
                                           uint32_t it_opt);
#endif /* USE_HAL_ADC_DMA */
hal_status_t HAL_ADC_REG_TrigNextConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_REG_StopConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_REG_StopConv_IT(hal_adc_handle_t *hadc);
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
hal_status_t HAL_ADC_REG_StopConv_DMA(hal_adc_handle_t *hadc);
#endif /* USE_HAL_ADC_DMA */
hal_status_t HAL_ADC_REG_PollForConv(hal_adc_handle_t *hadc, uint32_t timeout_ms);
int32_t      HAL_ADC_REG_ReadConversionData(const hal_adc_handle_t *hadc);

hal_status_t HAL_ADC_INJ_StartConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_INJ_StartConv_IT(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_INJ_StartConv_IT_Opt(hal_adc_handle_t *hadc, uint32_t it_opt);
hal_status_t HAL_ADC_INJ_TrigNextConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_INJ_StopConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_INJ_StopConv_IT(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_INJ_PollForConv(hal_adc_handle_t *hadc, uint32_t timeout_ms);
int32_t      HAL_ADC_INJ_ReadConversionDataRank(const hal_adc_handle_t *hadc, uint8_t sequencer_rank);

#if defined(ADC_MULTIMODE_SUPPORT)
hal_status_t HAL_ADC_MM_Start(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_Stop(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_Calibrate(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_REG_StartConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_REG_StartConv_IT(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_REG_StartConv_IT_Opt(hal_adc_handle_t *hadc, uint32_t it_opt);
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
hal_status_t HAL_ADC_MM_REG_StartConv_DMA(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte);
hal_status_t HAL_ADC_MM_REG_StartConv_DMA_Opt(hal_adc_handle_t *hadc, uint8_t *p_data, uint32_t size_byte,
                                              uint32_t it_opt);
hal_status_t HAL_ADC_MM_REG_StartConvM_DMA(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_REG_StartConvM_DMA_Opt(hal_adc_handle_t *hadc, uint32_t it_opt);
#endif /* USE_HAL_ADC_DMA */
hal_status_t HAL_ADC_MM_REG_TrigNextConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_REG_StopConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_REG_StopConv_IT(hal_adc_handle_t *hadc);
#if defined(USE_HAL_ADC_DMA) && (USE_HAL_ADC_DMA == 1)
hal_status_t HAL_ADC_MM_REG_StopConv_DMA(hal_adc_handle_t *hadc);
#endif /* USE_HAL_ADC_DMA */
hal_status_t HAL_ADC_MM_REG_PollForConv(hal_adc_handle_t *hadc, uint32_t timeout_ms);
uint32_t     HAL_ADC_MM_REG_ReadConversionData(const hal_adc_handle_t *hadc, hal_adc_mm_inst_t multi_inst);
hal_status_t HAL_ADC_MM_INJ_StartConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_INJ_StartConv_IT(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_INJ_StartConv_IT_Opt(hal_adc_handle_t *hadc, uint32_t it_opt);
hal_status_t HAL_ADC_MM_INJ_TrigNextConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_INJ_StopConv(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_INJ_StopConv_IT(hal_adc_handle_t *hadc);
hal_status_t HAL_ADC_MM_INJ_PollForConv(hal_adc_handle_t *hadc, uint32_t timeout_ms);
uint32_t     HAL_ADC_MM_INJ_ReadConversionDataRank(const hal_adc_handle_t *hadc, hal_adc_mm_inst_t multi_inst,
                                                   uint8_t sequencer_rank);
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group6 User data functions
  * @{
  */
#if defined(USE_HAL_ADC_USER_DATA) && (USE_HAL_ADC_USER_DATA == 1)
void HAL_ADC_SetUserData(hal_adc_handle_t *hadc, const void *p_user_data);
const void *HAL_ADC_GetUserData(const hal_adc_handle_t *hadc);
#endif /* USE_HAL_ADC_USER_DATA */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* ADC1 || ADC2 || ADC3 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_ADC_H */
